<!--问答环节-->
</div><!-- /container -->
<div class="container">
 	<div class="page-header">
		<h3>一些常见问题</h3>
	</div>
	<div>
	<h4>我是个新手，请问网站如何使用？</h4>
	<p>我们尽可能为所有用户提供最简洁的功能，您在注册后对于每一部剧，都可以在剧的详细情况页面的右上方点击“订阅”或者通过其他页面的“订阅”按钮订阅一部剧。</p>
	<p>之后点击导航条（始终在网站最上面的那个大横条）点击自己的昵称或者手机号，在下拉菜单中选“我的剧集”就能看您关注剧集的近期状态了！</p>
	<p>“本月”按钮是用来看每个月每日的播放表，点任何日期都可以展开那一天会播放的剧集，而月份也可以通过月份那个长条左右边的上月或者下月按钮进行查找。</p>
	<P>“查找剧集”就是您在输入框中输入中英文进行查找的方法，请注意，错别字（如权‘利’的游戏）会导致查找失败。</P>
	<p>“当前热播”中英美剧热门是根据“订阅”最多的剧进行排序，而猜我喜欢是系统根据您的喜好推荐一些热门剧，您可以选择观看，这也就是为什么我们强烈建议您点击“订阅”的原因，既方便自己也方便他人。</p>
	<p>自己的昵称或者手机号下拉菜单点开后，个人中心可以修改密码和修改昵称，我的剧集就是您所订阅剧集的更新情况（非常好用，比您每次上来找要方便许多）.</p>
	<br/>
	<h4>“订阅”点一下花钱吗？</h4>
	<p>我们站的全部服务都是免费的，任何注册的用户的所有操作都不会让您付款（赞助我们除外）。我们也提醒您，任何打着我们网站旗号称“收费”的行为都是骗子。我们仅仅在《至全体用户的一封信》中安放了一张支付宝转账二维码供有兴趣的用户进行赞助我们，其他的付款方式均不是我们的！</p>
	<br/>
	<h4>那你们不赚钱是不是打我们用户别的主意？</h4>
	<p>事实上，我们几个是北京信息科技大学的几个有着共同兴趣爱好的穷学生，在学生优惠阶段这套服务器的价格是很低的，所以目前并没有投入太高的成本（人力不算）。但是我们过几个月毕业以后每个月会面临大约200元左右的运营成本（短信+服务器+域名），我们本想通过广告进行成本维持，但是出于对用户的尊重并没有上太重口的广告（上的是淘宝的官方广告）收入至今为0（用户量太小），我们会尽最大努力维持系统运转，但是如果有一天就此结束也请不要惊讶。为了这一天晚点到来我们也呼吁您赞助我们进行运营（赞助方式见<a href="/TVCalendarAPI/index.php/UI/docs/letter">致全体用户的一封信</a>），或者您在打算去淘宝卖东西前通过点击下方广告跳转到淘宝，这样能提升我们的广告评价从而早日从马云爸爸那里抠点钱出来。再或许，我们还出售广告位，如果您为我们介绍的话我们愿意与您分成。再再再或许，我们在必要时愿意出售整个站点如果能维持这个项目运转的话。</p>
	<br/>
	<h4>看上去你们好惨，那你们做这个图个啥？</h4>
	<p>首先，是爱好；其次，是为了满足自己圈子的使用（尤其是手机app发布后就能自动提醒我看剧了！）；最后，是对自己能力的检验。</p>
	<br/>
	<h4>我在下载的时候提示未安装应用，我该怎么办？</h4>
	<p>目前，我们提供的是电驴资源或者磁力链接，这些需要一个支持这些项目的客户端，您可以使用<a href="http://dl.xunlei.com/">迅雷</a>、<a href="http://xf.qq.com/">QQ旋风</a>、<a href="http://www.utorrent.com/intl/zh/">utorrent</a>,甚至百度云网盘的离线下载、360云盘的离线下载、115网盘的离线下载实现下载，至于在线观看的事情作为用户您就想都别想了，这是中国特色。</p>
	<br/>
	<h4>之前你们说要升级密码防护系统，是我们的密码不安全吗？</h4>
	<p>情况是这样的，很多用户都认为我们存放的是所有用户的明文密码，事实上在现代网站所有用户的“密码”都是一个根据原密码经过一个算法变成的一个等长的字符串，而每一个不同的密码所对应的字符串完全不同，这样您在每次登陆时只需要将输入的密码通过这种算法产生字符串与系统中的这个串比对验证您的身份即可，这样网站管理员就看不到您的密码（看到的只是一大长串字符乱码，而且这个字符乱码是不能倒推回原密码的）。</p>
	<p>这个问题或许我解释的不清楚，这里放两个连接：<a href="http://baike.baidu.com/view/7636.htm">百度百科——MD5算法</a>和<a href="http://baike.baidu.com/view/1228622.htm">百度百科——SHA1算法</a>,这些都是<a href="http://baike.baidu.com/view/273836.htm">哈希算法</a>的一种。</p>
	<p>但是由于很多年过去了，虽然这些算法是不可逆转的（实际上在某种意义上可以逆转，山大的王小云博士就做到了），很多黑客会将很多常见的字符串进行上述的运算并保存好运算结果，这样就能在拿到哈希值后猜原密码（这种叫暴力破解，对弱密码很有效），也就是说如果数据库被攻破，黑客是有可能掌握一些用弱密码的用户的密码的（如用户用“123456”，“19930203”，“password”这样的密码很危险）.</p>
	<p>所以我们决定更换这种密码算法，即既改用其他更加新的摘要算法，同时在所有的密码摘要中加入随机产生的干扰字符串（学名叫“盐，salt”）进行混合计算，这样从理论上来说使得用户密码即使被盗走也不会让人看出来这个密码是个啥.正如我们所说，我们一直关注于您的账号安全与隐私，即使有一天数据库遭到破坏您的个人隐私数据也是安全的。目前密码防护算法已经更新完成，而且在更新之前或者之后您的安全都是得到保障的，这次更新为预防性更新。</p>
	<h4>其他问题</h4>
	<p>其他问题欢迎您<a href="mailto:zhuyf8899@gmail.com">点击这里</a>和我们使用邮件交谈或者直接发送邮件给:zhuyf8899@gmail.com</p>
</div>